miketeachman/micropython/ports/mimxrt/machine_i2s.c
typedef struct _i2s_mapping_t {
        uint8_t hw_id;
        i2s_pin_function_t fn;
        i2s_mode_t mode;
        qstr name;
        iomux_table_t iomux;
} i2s_mapping_t;

typedef struct _i2s_pll_rate_t {
        int32_t rate;
        const clock_audio_pll_config_t *pll_config;
} i2s_pll_rate_t;

STATIC mp_obj_t machine_i2s_deinit(mp_obj_t self_in);

// The frame map is used with the readinto() method to transform the audio sample data coming
// from DMA memory (32-bit stereo) to the format specified
// in the I2S constructor.  e.g.  16-bit mono
STATIC const int8_t i2s_frame_map[NUM_I2S_USER_FORMATS][I2S_RX_FRAME_SIZE_IN_BYTES] = {
    {-1, -1,  0,  1, -1, -1, -1, -1 },  // Mono, 16-bits
    { 0,  1,  2,  3, -1, -1, -1, -1 },  // Mono, 32-bits
    {-1, -1,  0,  1, -1, -1,  2,  3 },  // Stereo, 16-bits
    { 0,  1,  2,  3,  4,  5,  6,  7 },  // Stereo, 32-bits
};

// PLL configurations:
// Use the built-in 24MHz crystal oscillator as the source
// The PLLs oscillator frequency range is from 650 MHz to 1300 MHz

// Configuration for frequencies [Hz]:  8000, 12000, 16000, 24000, 32000, 48000
STATIC const clock_audio_pll_config_t audioPllConfig_8000_48000 = {
    .loopDivider = 32,          // PLL loop divider. Valid range for DIV_SELECT divider value: 27~54
    .postDivider = 1,           // Divider after the PLL, should only be 1, 2, 4, 8, 16
    .numerator = 76802,         // 30 bit numerator of fractional loop divider
    .denominator = 100000,      // 30 bit denominator of fractional loop divider
    .src = kCLOCK_PllClkSrc24M  // Pll clock source
};

// Configuration for frequencies [Hz]:  11025, 22050, 44100
STATIC const clock_audio_pll_config_t audioPllConfig_11025_44100 = {
    .loopDivider = 30,          // PLL loop divider. Valid range for DIV_SELECT divider value: 27~54
    .postDivider = 1,           // Divider after the PLL, should only be 1, 2, 4, 8, 16
    .numerator = 10562,         // 30 bit numerator of fractional loop divider
    .denominator = 100000,      // 30 bit denominator of fractional loop divider
    .src = kCLOCK_PllClkSrc24M  // Pll clock source
};

STATIC const i2s_pll_rate_t pll_rate_map[] = {
    {kSAI_SampleRate8KHz, &audioPllConfig_8000_48000},
    {kSAI_SampleRate11025Hz, &audioPllConfig_11025_44100},
    {kSAI_SampleRate12KHz, &audioPllConfig_8000_48000},
    {kSAI_SampleRate16KHz, &audioPllConfig_8000_48000},
    {kSAI_SampleRate22050Hz, &audioPllConfig_11025_44100},
    {kSAI_SampleRate24KHz, &audioPllConfig_8000_48000},
    {kSAI_SampleRate32KHz, &audioPllConfig_8000_48000},
    {kSAI_SampleRate44100Hz, &audioPllConfig_11025_44100},
    {kSAI_SampleRate48KHz, &audioPllConfig_8000_48000}
};

STATIC const uint8_t i2s_hw_index_table[] = MICROPY_HW_I2S_INDEX;
STATIC I2S_Type *i2s_base_ptr_table[] = I2S_BASE_PTRS;
STATIC const int i2s_clock_mux[] = I2S_CLOCK_MUX;
STATIC const int i2s_clock_pre_div[] = I2S_CLOCK_PRE_DIV;
STATIC const int i2s_clock_div[] = I2S_CLOCK_DIV;
STATIC const uint16_t i2s_dma_req_src_tx[] = I2S_DMA_REQ_SRC_TX;
STATIC const uint16_t i2s_dma_req_src_rx[] = I2S_DMA_REQ_SRC_RX;
STATIC const i2s_mapping_t i2s_mapping_table[] = { I2S_AF_MAP };
AT_NONCACHEABLE_SECTION_ALIGN(STATIC edma_tcd_t emdaTcd, 32);  // TODO per-instance basis?

void machine_i2s_init0() {
    for (uint8_t i = 0; i < MICROPY_HW_NUM_I2S; i++) {
        MP_STATE_PORT(machine_i2s_obj)[i] = NULL;
    }
}

// Ring Buffer
// Thread safe when used with these constraints:
// - Single Producer, Single Consumer
// - Sequential atomic operations
// One byte of capacity is used to detect buffer empty/full

STATIC void ringbuf_init(ring_buf_t *rbuf, uint8_t *buffer, size_t size) {
    rbuf->buffer = buffer;
    rbuf->size = size;
    rbuf->head = 0;
    rbuf->tail = 0;
}

STATIC bool ringbuf_push(ring_buf_t *rbuf, uint8_t data) {
    size_t next_tail = (rbuf->tail + 1) % rbuf->size;

    if (next_tail != rbuf->head) {
        rbuf->buffer[rbuf->tail] = data;
        rbuf->tail = next_tail;
        return true;
    }

    // full
    return false;
}

STATIC bool ringbuf_pop(ring_buf_t *rbuf, uint8_t *data) {
    if (rbuf->head == rbuf->tail) {
        // empty
        return false;
    }

    *data = rbuf->buffer[rbuf->head];
    rbuf->head = (rbuf->head + 1) % rbuf->size;
    return true;
}

STATIC bool ringbuf_is_empty(ring_buf_t *rbuf) {
    return rbuf->head == rbuf->tail;
}

STATIC bool ringbuf_is_full(ring_buf_t *rbuf) {
    return ((rbuf->tail + 1) % rbuf->size) == rbuf->head;
}

STATIC size_t ringbuf_available_data(ring_buf_t *rbuf) {
    return (rbuf->tail - rbuf->head + rbuf->size) % rbuf->size;
}

STATIC size_t ringbuf_available_space(ring_buf_t *rbuf) {
    return rbuf->size - ringbuf_available_data(rbuf) - 1;
}

STATIC int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        if (bits == 16) {
            return 0;
        } else { // 32 bits
            return 1;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        } else { // 32 bits
            return 3;
        }
    }
}

STATIC int8_t get_dma_bits(uint16_t mode, int8_t bits) {
    if (mode == TX) {
        if (bits == 16) {
            return 16;
        } else {
            return 32;
        }
        return bits;
    } else { // Master Rx
        // always read 32 bit words for I2S e.g.  I2S MEMS microphones
        return 32;
    }
}

// TODO refactor common portions of set_iomux() and is_pin_supported()
STATIC bool set_iomux(const machine_pin_obj_t *pin, i2s_pin_function_t fn, i2s_mode_t mode, uint8_t hw_id) {
    for (uint16_t i=0; i<sizeof(i2s_mapping_table)/sizeof(i2s_mapping_t); i++) {
        if (pin->name == i2s_mapping_table[i].name) {
            if ((i2s_mapping_table[i].fn == fn) &&
                (i2s_mapping_table[i].hw_id == hw_id) &&
                (i2s_mapping_table[i].mode == mode)) {
                iomux_table_t iom = i2s_mapping_table[i].iomux;
                IOMUXC_SetPinMux(iom.muxRegister, iom.muxMode, iom.inputRegister, iom.inputDaisy, iom.configRegister, 1U);
                IOMUXC_SetPinConfig(iom.muxRegister, iom.muxMode, iom.inputRegister, iom.inputDaisy, iom.configRegister, 0x10B0u);
                return true;
            }
        }
    }
    return false;
}

STATIC bool is_pin_supported(machine_pin_obj_t *pin, i2s_pin_function_t fn, i2s_mode_t mode, uint8_t hw_id) {
    for (uint16_t i=0; i<sizeof(i2s_mapping_table)/sizeof(i2s_mapping_t); i++) {
        if (pin->name == i2s_mapping_table[i].name) {
            if ((i2s_mapping_table[i].fn == fn) &&
                (i2s_mapping_table[i].hw_id == hw_id) &&
                (i2s_mapping_table[i].mode == mode)) {
                return true;
            }
        }
    }
    return false;
}

bool is_rate_supported(int32_t rate) {
    for (uint16_t i=0; i<sizeof(pll_rate_map)/sizeof(i2s_pll_rate_t); i++) {
        if (pll_rate_map[i].rate == rate) {
            return true;
        }
    }
    return false;
}

